import pandas as pd

data ={
    "name": ["Александр Македонский", "Александр Суворов", "Фёдор Сухов", "Папс Терминатор", "Али Абабуа", "Кряк Лапчатый", "Зигзаг Макряк", "Михаил Огинский", "Ричард Сандерс", "Касьян Полубой"],
    "арифметика": [5, 5, 4, 5, 1, 3, 3, 4, 4, 4],
    "алхимия": [5, 3, 3, 4, 1, 4, 3, 3, 4, 5],
    "астрология": [5, 4, 3, 5,1, 5, 3, 5, 4, 4  ],
    "зельеваренье": [5, 2, 2, 2, 5, 5, 3, 2, 4, 4 ],
    "прорицание": [5, 5, 5, 4, 3, 3, 2, 5, 5, 5  ]
}

df = pd.DataFrame(data)

subjects = ["арифметика", "алхимия", "астрология", "зельеваренье", "прорицание"]
for subject in subjects:
    print(f"Средний балл по предмету {subject}: {df[subject].mean()}")
    print(f"Медианный балл по предмету {subject}:{df[subject].median()}")
    print(f"Стандартное отклонение {subject}:{df[subject].std()}",end = "\n\n")

q1 = df['арифметика'].quantile(0.25) #вычисляем квантили- 0.25 и 0.75, для арифметики
q3 = df['арифметика'].quantile(0.75) # вычисляем квантили - 0.25 и 0.75, для арифметики.
iqr = q3 - q1 # вычисляем разницу между квантилями

print(f"Q1: {q1}")
print(f"Q3: {q3}")
print(f"IQR: {iqr}")





